## Reading CSV file

In [42]:
import pandas as pd

In [43]:
# reading from cvs file to dataframe
df = pd.read_csv("EasyVisa.csv")
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [44]:
# shape of dataframe
df.shape

(25480, 12)

In [45]:
# colmuns in our dataframe
df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

## Storing CSV file Data to MongoDB

client << database << collection << records

### Incase of time out issue
if facing timeout error
```python
import certifi
client=pymongo.MongoClient(CONNECTION_URL,tlsCAFile=certifi.where())
# TO CREATE THE DATABASE
data_base=client[DB_NAME]
collection=data_base[COLLECTION_NAME]
# INSET DATA INTO THE COLLECTION
rec = collection.insert_many(data)
```

In [50]:
# converting datadbframe to dictionay to store in mongo
data=df.to_dict(orient="records")
len(data)

25480

In [48]:
import pymongo
from dotenv import load_dotenv
import os

# Load environment variables from the .env file
load_dotenv()

# Get the MongoDB URI from the environment variable
CONNECTION_URL = os.getenv("CONNECTION_URL")

if not CONNECTION_URL:
    raise ValueError("CONNECTION_URL is not set in the environment variables")
# Creating DB name
DB_Name="US_VISA"
# Creating collection name for the db
COLLECTION_NAME="visa_data"
# Connection URL for the DB
# CONNECTION_URL="mongodb+srv://MRameezU:Cl%40ssification@cluster0.l0ocg.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"

In [49]:
# 1. creating Client
client=pymongo.MongoClient(host=CONNECTION_URL)
# 2. Creating database inside  client 
data_base=client[DB_Name]
# 3. Creating collection inside database
collection=data_base[COLLECTION_NAME]
# 4. Store the data inside collection
rec=collection.insert_many(data)

## Fetcing data from DataBase

In [31]:
records=collection.find()
records

In [32]:
#  getting datafrom record
for idx, data in enumerate(records):
    print(f"Index: {idx} , Data: {data}")
    if idx == 5:  # Stop after the 6th record
        break

Index: 0 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607a5'), 'case_id': 'EZYV01', 'continent': 'Asia', 'education_of_employee': 'High School', 'has_job_experience': 'N', 'requires_job_training': 'N', 'no_of_employees': 14513, 'yr_of_estab': 2007, 'region_of_employment': 'West', 'prevailing_wage': 592.2029, 'unit_of_wage': 'Hour', 'full_time_position': 'Y', 'case_status': 'Denied'}
Index: 1 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607a6'), 'case_id': 'EZYV02', 'continent': 'Asia', 'education_of_employee': "Master's", 'has_job_experience': 'Y', 'requires_job_training': 'N', 'no_of_employees': 2412, 'yr_of_estab': 2002, 'region_of_employment': 'Northeast', 'prevailing_wage': 83425.65, 'unit_of_wage': 'Year', 'full_time_position': 'Y', 'case_status': 'Certified'}
Index: 2 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607a7'), 'case_id': 'EZYV03', 'continent': 'Asia', 'education_of_employee': "Bachelor's", 'has_job_experience': 'N', 'requires_job_training': 'Y', 'no_of_employees': 44444, 'yr_of_estab': 2008, 'region_of_employment': 'West', 'prevailing_wage': 122996.86, 'unit_of_wage': 'Year', 'full_time_position': 'Y', 'case_status': 'Denied'}
Index: 3 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607a8'), 'case_id': 'EZYV04', 'continent': 'Asia', 'education_of_employee': "Bachelor's", 'has_job_experience': 'N', 'requires_job_training': 'N', 'no_of_employees': 98, 'yr_of_estab': 1897, 'region_of_employment': 'West', 'prevailing_wage': 83434.03, 'unit_of_wage': 'Year', 'full_time_position': 'Y', 'case_status': 'Denied'}
Index: 4 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607a9'), 'case_id': 'EZYV05', 'continent': 'Africa', 'education_of_employee': "Master's", 'has_job_experience': 'Y', 'requires_job_training': 'N', 'no_of_employees': 1082, 'yr_of_estab': 2005, 'region_of_employment': 'South', 'prevailing_wage': 149907.39, 'unit_of_wage': 'Year', 'full_time_position': 'Y', 'case_status': 'Certified'}
Index: 5 , Data: {'_id': ObjectId('66f48b7c717ad810fbd607aa'), 'case_id': 'EZYV06', 'continent': 'Asia', 'education_of_employee': "Master's", 'has_job_experience': 'Y', 'requires_job_training': 'N', 'no_of_employees': 2339, 'yr_of_estab': 2012, 'region_of_employment': 'South', 'prevailing_wage': 78252.14, 'unit_of_wage': 'Year', 'full_time_position': 'Y', 'case_status': 'Certified'}

In [33]:
df=pd.DataFrame(list(collection.find()))
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,66f48b7c717ad810fbd607a5,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,66f48b7c717ad810fbd607a6,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,66f48b7c717ad810fbd607a7,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,66f48b7c717ad810fbd607a8,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,66f48b7c717ad810fbd607a9,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [36]:
# remove _id column
if "_id" in df.columns.to_list():
    df=df.drop(columns=["_id"],axis=1)

In [37]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified